Revit 2024 API
ScheduleFilter.IsElementIdValue Property
 Indicates if the filter has an ElementId value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsElementIdValue { get; }
Visual Basic
Public ReadOnly Property IsElementIdValue As Boolean
	Get
Visual C++
public:
property bool IsElementIdValue {
	bool get ();
}
See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace